Autodesk.Revit.DB.ImageExportOptions.GetViewsAndSheets
Gets a list of views and sheets to be exported.  Used only when ExportRange is SetOfViews.
Returns:
The ids of the views and sheets.
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.SetViewsAndSheets(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets a list of views and sheets to be exported.  Used only when ExportRange is SetOfViews.
viewsAndSheets:
The ids of the views and sheets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.GetFileName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the file name that will be produced when exporting a view to an image.
aDoc:
The document that owns the view.
dbViewId:
View which is to be exported as image.
Returns:
The generated exported image file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ImageExportOptions.IsValidFileName(System.String)
Verify if File name is valid
filePath:
File path to be tested for valid file name
Returns:
True if File name is valid; false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.IsValidForSaveToProjectAsImage(Autodesk.Revit.DB.ImageExportOptions,Autodesk.Revit.DB.Document)
Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
options:
ImageExportOptions object to be validated
doc:
Document for view name verification
Returns:
True if ImageExportOptions object is valid for calling saveToProjectAsImage; false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ImageExportOptions.ExportRange
The export range defining which view(s) will be exported.
Remarks:
Note that SetOfViews is not an acceptable value if these options are used to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ShouldCreateWebSite
Whether or not to create a web site with a page for each export.  Used only when ExportRange is SetOfViews.
Remarks:
The default is false.
This field is ignored if used to save an image to a project as a new view.
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.FilePath
The file name and path for the exported file.
Remarks:
If ExportRange is SetOfViews, the name of each view or sheet will be
appended to the name provided for each exported file.
This field is ignored if used to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input file path is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ViewName
The name of the view to be created.
Remarks:
This field is used only to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.FitDirection
The fit direction.  Used only if ZoomType is FitToPage.
Remarks:
The default is Horizontal.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.HLRandWFViewsFileType
File type for exported HLR and wireframe views.
Remarks:
The default is JPEGMedium.
This field is ignored if used to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ShadowViewsFileType
The file type for exported shadow views.
Remarks:
The default is JPEGMedium.
This field is ignored if used to save an image to a project as a new view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ImageResolution
The image resolution in dots per inch.
Remarks:
The default is DPI_72.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.PixelSize
The pixel size of an image in one direction.  Used only if ZoomType is FitToPage.
Remarks:
The default is 512 pixels.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The PixelSize value is outside the permitted range.
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.Zoom
The value for Zoom (as a percentage).   Used only when ZoomType is Zoom.
Remarks:
The default is 50.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The Zoom value is outside the permitted range.
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.ZoomType
The zoom type, which defines how the image size is determined.
Remarks:
The default is FitToPage.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ImageExportOptions.#ctor
Constructs a new instance of the options class used to produce images.
Since:
2011

Autodesk.Revit.DB.ImageExportOptions
This class defines options for exporting views and sheets as an image.
Since:
2011